Tekla Open API Reference for Tekla Structures 2025
RebarSplice Constructor
 Initializes a new rebar splice instance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSplice()
Public Sub New
See Also
Reference
RebarSplice Class
RebarSplice Overload
Tekla.Structures.Model Namespace